数据结构
数据结构
数据结构
树
存储
多
多对多


有人说，程序=算法+(1)____。

计算机解决一个具体问题时，大致需要经过下列几个步骤：

首先要从具体问题中抽象出一个适当的数学模型，然后设计一个解此数学模型的算法，最后编出程序、进行测试、调整直至得到最终解答。

寻求数学模型的实质是分析问题，从中提取操作的对象，并找出这些操作对象之间含有的关系，然后用数学的语言加以描述。

当人们用计算机处理数值计算问题时，所用的数学模型是用数学方程描述。

然而，计算机应用的更多领域是“非数值型计算问题”，它们的数学模型无法用数学方程描述，而是用(2)____描述。

解决此类问题的关键是设计出合适的(3)____。

描述非数值型问题的数学模型是用线性表、(4)_____、图等结构来描述的。

数据结构具体指同一类数据元素中，各元素之间的相互关系，包括三个组成成分，数据的逻辑结构，数据的(5)____结构和数据运算结构。

数据的逻辑结构指反映数据元素之间的逻辑关系的数据结构，其中的逻辑关系是指数据元素之间的前后件关系，而与他们在计算机中的存储位置无关。

逻辑结构包括：

集合：数据结构中的元素之间除了“同属一个集合”的相互关系外，别无其他关系；
线性：数据结构中的元素存在一对一的相互关系；
树：数据结构中的元素存在一对(6)____的相互关系；
图：数据结构中的元素存在(7)____的相互关系。